RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6200/ip/hpm_pwm_regs.h
/*
 * Copyright (c) 2021-2024 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_PWM_H
#define HPM_PWM_H

typedef struct {
    __RW uint32_t UNLK;                        /* 0x0: Shadow registers unlock register */
    union {
        __RW uint32_t STA;                     /* 0x4: Counter start register */
        __RW uint32_t STA_HRPWM;               /* 0x4: Counter start register */
    };
    union {
        __RW uint32_t RLD;                     /* 0x8: Counter reload register */
        __RW uint32_t RLD_HRPWM;               /* 0x8: Counter reload register */
    };
    union {
        __RW uint32_t CMP[16];                 /* 0xC - 0x48: Comparator register */
        __RW uint32_t CMP_HRPWM[16];           /* 0xC - 0x48: Comparator register */
    };
    __R  uint8_t  RESERVED0[44];               /* 0x4C - 0x77: Reserved */
    __RW uint32_t FRCMD;                       /* 0x78: Force output mode register */
    __RW uint32_t SHLK;                        /* 0x7C: Shadow registers lock register */
    __RW uint32_t CHCFG[16];                   /* 0x80 - 0xBC: Output channel configure register */
    __R  uint8_t  RESERVED1[48];               /* 0xC0 - 0xEF: Reserved */
    __RW uint32_t GCR;                         /* 0xF0: Global control register */
    __RW uint32_t SHCR;                        /* 0xF4: Shadow register control register */
    __R  uint8_t  RESERVED2[8];                /* 0xF8 - 0xFF: Reserved */
    __R  uint32_t CAPPOS[16];                  /* 0x100 - 0x13C: Capture rising edge register */
    __R  uint8_t  RESERVED3[48];               /* 0x140 - 0x16F: Reserved */
    __R  uint32_t CNT;                         /* 0x170: Counter */
    __R  uint8_t  RESERVED4[12];               /* 0x174 - 0x17F: Reserved */
    __R  uint32_t CAPNEG[16];                  /* 0x180 - 0x1BC: Capture falling edge register */
    __R  uint8_t  RESERVED5[48];               /* 0x1C0 - 0x1EF: Reserved */
    __R  uint32_t CNTCOPY;                     /* 0x1F0: Counter copy */
    __R  uint8_t  RESERVED6[12];               /* 0x1F4 - 0x1FF: Reserved */
    __RW uint32_t PWMCFG[8];                   /* 0x200 - 0x21C: PWM channel configure register */
    __W  uint32_t SR;                          /* 0x220: Status register */
    __RW uint32_t IRQEN;                       /* 0x224: Interrupt request enable register */
    __R  uint8_t  RESERVED7[4];                /* 0x228 - 0x22B: Reserved */
    __RW uint32_t DMAEN;                       /* 0x22C: DMA request enable register */
    __RW uint32_t CMPCFG[16];                  /* 0x230 - 0x26C: Comparator configure register */
    __R  uint8_t  RESERVED8[400];              /* 0x270 - 0x3FF: Reserved */
    __R  uint32_t ANASTS[8];                   /* 0x400 - 0x41C: analog status register */
    __RW uint32_t HRPWM_CFG;                   /* 0x420: hrpwm config register */
    __RW uint32_t ANA_CFG0;                    /* 0x424: analog config register */
} PWM_Type;


/* Bitfield definition for register: UNLK */
/*
 * SHUNLK (RW)
 *
 * write 0xB0382607 to unlock the shadow registers of register offset from 0x04 to 0x78,
 * otherwise the shadow registers can not be written.
 */
#define PWM_UNLK_SHUNLK_MASK (0xFFFFFFFFUL)
#define PWM_UNLK_SHUNLK_SHIFT (0U)
#define PWM_UNLK_SHUNLK_SET(x) (((uint32_t)(x) << PWM_UNLK_SHUNLK_SHIFT) & PWM_UNLK_SHUNLK_MASK)
#define PWM_UNLK_SHUNLK_GET(x) (((uint32_t)(x) & PWM_UNLK_SHUNLK_MASK) >> PWM_UNLK_SHUNLK_SHIFT)

/* Bitfield definition for register: STA */
/*
 * XSTA (RW)
 *
 * pwm timer counter extended start point, should back to this value after reach xrld
 */
#define PWM_STA_XSTA_MASK (0xF0000000UL)
#define PWM_STA_XSTA_SHIFT (28U)
#define PWM_STA_XSTA_SET(x) (((uint32_t)(x) << PWM_STA_XSTA_SHIFT) & PWM_STA_XSTA_MASK)
#define PWM_STA_XSTA_GET(x) (((uint32_t)(x) & PWM_STA_XSTA_MASK) >> PWM_STA_XSTA_SHIFT)

/*
 * STA (RW)
 *
 * pwm timer counter start value
 *  sta/rld will be loaded from shadow register to work register at main counter reload time, or software write unlk.shunlk
 */
#define PWM_STA_STA_MASK (0xFFFFFF0UL)
#define PWM_STA_STA_SHIFT (4U)
#define PWM_STA_STA_SET(x) (((uint32_t)(x) << PWM_STA_STA_SHIFT) & PWM_STA_STA_MASK)
#define PWM_STA_STA_GET(x) (((uint32_t)(x) & PWM_STA_STA_MASK) >> PWM_STA_STA_SHIFT)

/* Bitfield definition for register: STA_HRPWM */
/*
 * STA (RW)
 *
 */
#define PWM_STA_HRPWM_STA_MASK (0xFFFFFF00UL)
#define PWM_STA_HRPWM_STA_SHIFT (8U)
#define PWM_STA_HRPWM_STA_SET(x) (((uint32_t)(x) << PWM_STA_HRPWM_STA_SHIFT) & PWM_STA_HRPWM_STA_MASK)
#define PWM_STA_HRPWM_STA_GET(x) (((uint32_t)(x) & PWM_STA_HRPWM_STA_MASK) >> PWM_STA_HRPWM_STA_SHIFT)

/* Bitfield definition for register: RLD */
/*
 * XRLD (RW)
 *
 * timeout counter extended reload point, counter will reload to xsta after reach this point
 */
#define PWM_RLD_XRLD_MASK (0xF0000000UL)
#define PWM_RLD_XRLD_SHIFT (28U)
#define PWM_RLD_XRLD_SET(x) (((uint32_t)(x) << PWM_RLD_XRLD_SHIFT) & PWM_RLD_XRLD_MASK)
#define PWM_RLD_XRLD_GET(x) (((uint32_t)(x) & PWM_RLD_XRLD_MASK) >> PWM_RLD_XRLD_SHIFT)

/*
 * RLD (RW)
 *
 * pwm timer counter reload value
 */
#define PWM_RLD_RLD_MASK (0xFFFFFF0UL)
#define PWM_RLD_RLD_SHIFT (4U)
#define PWM_RLD_RLD_SET(x) (((uint32_t)(x) << PWM_RLD_RLD_SHIFT) & PWM_RLD_RLD_MASK)
#define PWM_RLD_RLD_GET(x) (((uint32_t)(x) & PWM_RLD_RLD_MASK) >> PWM_RLD_RLD_SHIFT)

/* Bitfield definition for register: RLD_HRPWM */
/*
 * RLD (RW)
 *
 */
#define PWM_RLD_HRPWM_RLD_MASK (0xFFFFFF00UL)
#define PWM_RLD_HRPWM_RLD_SHIFT (8U)
#define PWM_RLD_HRPWM_RLD_SET(x) (((uint32_t)(x) << PWM_RLD_HRPWM_RLD_SHIFT) & PWM_RLD_HRPWM_RLD_MASK)
#define PWM_RLD_HRPWM_RLD_GET(x) (((uint32_t)(x) & PWM_RLD_HRPWM_RLD_MASK) >> PWM_RLD_HRPWM_RLD_SHIFT)

/*
 * RLD_HR (RW)
 *
 * pwm timer counter reload value at high resolution, only exist if hwpwm is enabled.
 */
#define PWM_RLD_HRPWM_RLD_HR_MASK (0xFFU)
#define PWM_RLD_HRPWM_RLD_HR_SHIFT (0U)
#define PWM_RLD_HRPWM_RLD_HR_SET(x) (((uint32_t)(x) << PWM_RLD_HRPWM_RLD_HR_SHIFT) & PWM_RLD_HRPWM_RLD_HR_MASK)
#define PWM_RLD_HRPWM_RLD_HR_GET(x) (((uint32_t)(x) & PWM_RLD_HRPWM_RLD_HR_MASK) >> PWM_RLD_HRPWM_RLD_HR_SHIFT)

/* Bitfield definition for register: 0 */
/*
 * XCMP (RW)
 *
 * extended counter compare value
 */
#define PWM_CMP_XCMP_MASK (0xF0000000UL)
#define PWM_CMP_XCMP_SHIFT (28U)
#define PWM_CMP_XCMP_SET(x) (((uint32_t)(x) << PWM_CMP_XCMP_SHIFT) & PWM_CMP_XCMP_MASK)
#define PWM_CMP_XCMP_GET(x) (((uint32_t)(x) & PWM_CMP_XCMP_MASK) >> PWM_CMP_XCMP_SHIFT)

