RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6200/ip/hpm_pwm_regs.h
/*
 * CNT_UPDATE_EDGE (RW)
 *
 * 0 for posedge; 1 for negedge if hardware trigger time is selected for update_time, and selected channel is capture mode, for counter shadow registers
 */
#define PWM_SHCR_CNT_UPDATE_EDGE_MASK (0x4000U)
#define PWM_SHCR_CNT_UPDATE_EDGE_SHIFT (14U)
#define PWM_SHCR_CNT_UPDATE_EDGE_SET(x) (((uint32_t)(x) << PWM_SHCR_CNT_UPDATE_EDGE_SHIFT) & PWM_SHCR_CNT_UPDATE_EDGE_MASK)
#define PWM_SHCR_CNT_UPDATE_EDGE_GET(x) (((uint32_t)(x) & PWM_SHCR_CNT_UPDATE_EDGE_MASK) >> PWM_SHCR_CNT_UPDATE_EDGE_SHIFT)

/*
 * FORCE_UPDATE_EDGE (RW)
 *
 * 0 for posedge; 1 for negedge if hardware trigger time is selected for update_time, and selected channel is capture mode, for FRCMD shadow registers
 */
#define PWM_SHCR_FORCE_UPDATE_EDGE_MASK (0x2000U)
#define PWM_SHCR_FORCE_UPDATE_EDGE_SHIFT (13U)
#define PWM_SHCR_FORCE_UPDATE_EDGE_SET(x) (((uint32_t)(x) << PWM_SHCR_FORCE_UPDATE_EDGE_SHIFT) & PWM_SHCR_FORCE_UPDATE_EDGE_MASK)
#define PWM_SHCR_FORCE_UPDATE_EDGE_GET(x) (((uint32_t)(x) & PWM_SHCR_FORCE_UPDATE_EDGE_MASK) >> PWM_SHCR_FORCE_UPDATE_EDGE_SHIFT)

/*
 * FRCSHDWSEL (RW)
 *
 * This bitfield select one of the comparators as hardware event time to load FRCMD shadow registers
 */
#define PWM_SHCR_FRCSHDWSEL_MASK (0x1F00U)
#define PWM_SHCR_FRCSHDWSEL_SHIFT (8U)
#define PWM_SHCR_FRCSHDWSEL_SET(x) (((uint32_t)(x) << PWM_SHCR_FRCSHDWSEL_SHIFT) & PWM_SHCR_FRCSHDWSEL_MASK)
#define PWM_SHCR_FRCSHDWSEL_GET(x) (((uint32_t)(x) & PWM_SHCR_FRCSHDWSEL_MASK) >> PWM_SHCR_FRCSHDWSEL_SHIFT)

/*
 * CNTSHDWSEL (RW)
 *
 * This bitfield select one of the comparators as hardware event time to load the counter related shadow registers (STA and RLD)
 */
#define PWM_SHCR_CNTSHDWSEL_MASK (0xF8U)
#define PWM_SHCR_CNTSHDWSEL_SHIFT (3U)
#define PWM_SHCR_CNTSHDWSEL_SET(x) (((uint32_t)(x) << PWM_SHCR_CNTSHDWSEL_SHIFT) & PWM_SHCR_CNTSHDWSEL_MASK)
#define PWM_SHCR_CNTSHDWSEL_GET(x) (((uint32_t)(x) & PWM_SHCR_CNTSHDWSEL_MASK) >> PWM_SHCR_CNTSHDWSEL_SHIFT)

/*
 * CNTSHDWUPT (RW)
 *
 * This bitfield select when the counter related shadow registers (STA and RLD) will be loaded to its work register
 * 00:  after software set shlk bit of shlk register
 * 01:  immediately after the register being modified
 * 10:  after hardware event assert, user can select one of the comparators to generate this hardware event.
 *        The comparator can be either output compare mode or input capture mode.
 * 11:  after SHSYNCI assert
 */
#define PWM_SHCR_CNTSHDWUPT_MASK (0x6U)
#define PWM_SHCR_CNTSHDWUPT_SHIFT (1U)
#define PWM_SHCR_CNTSHDWUPT_SET(x) (((uint32_t)(x) << PWM_SHCR_CNTSHDWUPT_SHIFT) & PWM_SHCR_CNTSHDWUPT_MASK)
#define PWM_SHCR_CNTSHDWUPT_GET(x) (((uint32_t)(x) & PWM_SHCR_CNTSHDWUPT_MASK) >> PWM_SHCR_CNTSHDWUPT_SHIFT)

/*
 * SHLKEN (RW)
 *
 * 1- enable shadow registers lock feature,
 * 0- disable shadow registers lock, shlk bit will always be 0
 */
#define PWM_SHCR_SHLKEN_MASK (0x1U)
#define PWM_SHCR_SHLKEN_SHIFT (0U)
#define PWM_SHCR_SHLKEN_SET(x) (((uint32_t)(x) << PWM_SHCR_SHLKEN_SHIFT) & PWM_SHCR_SHLKEN_MASK)
#define PWM_SHCR_SHLKEN_GET(x) (((uint32_t)(x) & PWM_SHCR_SHLKEN_MASK) >> PWM_SHCR_SHLKEN_SHIFT)

/* Bitfield definition for register array: CAPPOS */
/*
 * CAPPOS (RO)
 *
 * counter value captured at input posedge
 */
#define PWM_CAPPOS_CAPPOS_MASK (0xFFFFFFF0UL)
#define PWM_CAPPOS_CAPPOS_SHIFT (4U)
#define PWM_CAPPOS_CAPPOS_GET(x) (((uint32_t)(x) & PWM_CAPPOS_CAPPOS_MASK) >> PWM_CAPPOS_CAPPOS_SHIFT)

/* Bitfield definition for register: CNT */
/*
 * XCNT (RO)
 *
 * current extended counter  value
 */
#define PWM_CNT_XCNT_MASK (0xF0000000UL)
#define PWM_CNT_XCNT_SHIFT (28U)
#define PWM_CNT_XCNT_GET(x) (((uint32_t)(x) & PWM_CNT_XCNT_MASK) >> PWM_CNT_XCNT_SHIFT)

/*
 * CNT (RO)
 *
 * current clock counter  value
 */
#define PWM_CNT_CNT_MASK (0xFFFFFF0UL)
#define PWM_CNT_CNT_SHIFT (4U)
#define PWM_CNT_CNT_GET(x) (((uint32_t)(x) & PWM_CNT_CNT_MASK) >> PWM_CNT_CNT_SHIFT)

/* Bitfield definition for register array: CAPNEG */
/*
 * CAPNEG (RO)
 *
 * counter value captured at input signal falling edge
 */
#define PWM_CAPNEG_CAPNEG_MASK (0xFFFFFFFFUL)
#define PWM_CAPNEG_CAPNEG_SHIFT (0U)
#define PWM_CAPNEG_CAPNEG_GET(x) (((uint32_t)(x) & PWM_CAPNEG_CAPNEG_MASK) >> PWM_CAPNEG_CAPNEG_SHIFT)

/* Bitfield definition for register: CNTCOPY */
/*
 * XCNT (RO)
 *
 * current extended counter  value
 */
#define PWM_CNTCOPY_XCNT_MASK (0xF0000000UL)
#define PWM_CNTCOPY_XCNT_SHIFT (28U)
#define PWM_CNTCOPY_XCNT_GET(x) (((uint32_t)(x) & PWM_CNTCOPY_XCNT_MASK) >> PWM_CNTCOPY_XCNT_SHIFT)

/*
 * CNT (RO)
 *
 * current clock counter  value
 */
#define PWM_CNTCOPY_CNT_MASK (0xFFFFFF0UL)
#define PWM_CNTCOPY_CNT_SHIFT (4U)
#define PWM_CNTCOPY_CNT_GET(x) (((uint32_t)(x) & PWM_CNTCOPY_CNT_MASK) >> PWM_CNTCOPY_CNT_SHIFT)

/* Bitfield definition for register array: PWMCFG */
/*
 * HR_UPDATE_MODE (RW)
 *
 * 0: update the hr value for the first edge at reload point;
 * 1: update the hr value for the first edge at the last edge;
 * all others will be updated at previous edge
 * for pair mode, only pwm_cfg 0/2/4/6 are used
 */
#define PWM_PWMCFG_HR_UPDATE_MODE_MASK (0x20000000UL)
#define PWM_PWMCFG_HR_UPDATE_MODE_SHIFT (29U)
#define PWM_PWMCFG_HR_UPDATE_MODE_SET(x) (((uint32_t)(x) << PWM_PWMCFG_HR_UPDATE_MODE_SHIFT) & PWM_PWMCFG_HR_UPDATE_MODE_MASK)
#define PWM_PWMCFG_HR_UPDATE_MODE_GET(x) (((uint32_t)(x) & PWM_PWMCFG_HR_UPDATE_MODE_MASK) >> PWM_PWMCFG_HR_UPDATE_MODE_SHIFT)

/*
 * OEN (RW)
 *
 * PWM output enable
 * 1- output is enabled
 * 0- output is disabled
 */
#define PWM_PWMCFG_OEN_MASK (0x10000000UL)
#define PWM_PWMCFG_OEN_SHIFT (28U)
#define PWM_PWMCFG_OEN_SET(x) (((uint32_t)(x) << PWM_PWMCFG_OEN_SHIFT) & PWM_PWMCFG_OEN_MASK)
#define PWM_PWMCFG_OEN_GET(x) (((uint32_t)(x) & PWM_PWMCFG_OEN_MASK) >> PWM_PWMCFG_OEN_SHIFT)

/*
 * FRCSHDWUPT (RW)
 *
 * This bitfield select when the FRCMD shadow register will be loaded to its work register
 * 00:  after software set shlk bit of shlk register
 * 01:  immediately after the register being modified
 * 10:  after hardware event assert, user can select one of the comparators to generate this hardware event.
 *        The comparator can be either output compare mode or input capture mode.
 * 11:  after SHSYNCI assert
 */
#define PWM_PWMCFG_FRCSHDWUPT_MASK (0xC000000UL)
#define PWM_PWMCFG_FRCSHDWUPT_SHIFT (26U)
#define PWM_PWMCFG_FRCSHDWUPT_SET(x) (((uint32_t)(x) << PWM_PWMCFG_FRCSHDWUPT_SHIFT) & PWM_PWMCFG_FRCSHDWUPT_MASK)
#define PWM_PWMCFG_FRCSHDWUPT_GET(x) (((uint32_t)(x) & PWM_PWMCFG_FRCSHDWUPT_MASK) >> PWM_PWMCFG_FRCSHDWUPT_SHIFT)

